In [9]:

import os

import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [10]:
DATA_DIR = "C:/4-1/names"

In [11]:
p = os.path.abspath('C:/4-1/names/yob2010.txt')

In [12]:
x = pd.read_csv(p, 
            names=['Name', 'Gender', 'Count'])

In [13]:
x.sort_values(by='Count')
x[:3]

       Name Gender  Count
0  Isabella      F  22898
1    Sophia      F  20634
2      Emma      F  17333

In [14]:
def count_top_3(year):
    p = os.path.abspath('C:/4-1/names/yob' + str(year) + '.txt')
    x = pd.read_csv(p, 
            names=['Name', 'Gender', 'Count'])
    top = (x.sort_values(by='Count'))[-3::]
    top_3 = top.sort_values(by='Count')
    print(top_3)
    return top_3

In [15]:
count_top_3(2004)

          Name Gender  Count
0        Emily      F  25032
18826  Michael      M  25448
18825    Jacob      M  27876

          Name Gender  Count
0        Emily      F  25032
18826  Michael      M  25448
18825    Jacob      M  27876

In [21]:
def count_dynamics_new(years=[]):
    names_by_year = {}
    for year in years:
        names_by_year[year] = pd.read_csv('{}/yob{}.txt'.format(DATA_DIR, year),
            names=['Name','Gender','Count']
        )
    names_all = pd.concat(names_by_year, names=['Year', 'Pos'])
    name_dynamics = names_all.groupby([names_all.index.get_level_values(0), 'Gender']).sum()
    name_dynamics.query('Gender == ["F", "M"]').unstack('Gender')
    return name_dynamics

In [39]:
count_dynamics_new([1900, 1950, 2000])

               Count
Year Gender
1900 F        299810
     M        150486
1950 F       1713259
     M       1790871
2000 F       1814922
     M       1962744

In [40]:
def count_top_3_new(years=[]):
    names_by_year = {}
    for year in years:
        names_by_year[year] = pd.read_csv('{}/yob{}.txt'.format(DATA_DIR, year),
            names=['Name','Gender','Count']
        )
    names_all = pd.concat(names_by_year, names=['Year', 'Pos'])
    name_dynamics = names_all.groupby([names_all.index.get_level_values(0), 'Name']).sum()
    name_dynamics.query('Year == ["1900", "1950", "2000"]')
    name_dynamics.query('Year == ["1900", "1950", "2000"]').unstack('Year')
    return name_dynamics

In [41]:
count_top_3_new([1900, 1950, 2000])

               Count
Year Name
1900 Aaron       103
     Abbie       112
     Abby          7
     Abe          56
     Abel         15
     Abigail      14
     Abner        21
     Abraham     100
     Abram        18
     Abron         5
     Ace           8
     Acie         10
     Acy           6
     Ada        1101
     Adabelle      5
     Adah         37
     Adaline      18
     Adam        111
     Adda         10
     Addie       551
     Addison      11
     Adel          8
     Adela        38
     Adelaida      8
     Adelaide    183
     Adelard       6
     Adelbert      7
     Adele       186
     Adelia       50
     Adelina      19
...              ...
2000 Zyanna       17
     Zyanne       12
     Zyanya       15
     Zyaria        7
     Zyasia       20
     Zyier         5
     Zyion        11
     Zykee         6
     Zykeia        5
     Zykeith       7
     Zykeria      54
     Zykeriah      5
     Zykerria     12
     Zykia        38
     Zykiera       5
     Zykira       10
     Zyla         10
     Zyler        13
     Zymir         8
     Zynia        11
     Zyniah        7
     Zyon         78
     Zyonna        5
     Zyquan       13
     Zyra          5
     Zyria        21
     Zyron        12
     Zyshaun       6
     Zyshawn      10
     Zyshonne     17

[40183 rows x 1 columns]